In [25]:
print("Hi Pandas")

Hi Pandas

In [1]:
import pandas as pd
import numpy as np

In [4]:
labels = ['a', 'b', 'c']

my_list = [10, 20, 30]

arr = np.array([10, 20, 30])

d={'a':10, 'b':20, 'c':30}

In [5]:
pd.Series(my_list)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(my_list, index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
Series = pd.Series(my_list, index=labels)
Series[0]

10

In [9]:
Series['a']

10

In [10]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [ ]:
#pandas dataframe

In [14]:
rows = ['X','Y','Z']

cols = ['A', 'B', 'C', 'D', 'E']

#creating an np array
data = np.round(np.random.randn(3,5),2)
                            #3 rows, 5 col and 2 signficiant digits

In [32]:
df=pd.DataFrame(data, rows, cols)
print(df)

      A     B     C     D     E
X -0.11 -0.23  0.37  0.68 -0.18
Y -0.71 -1.37 -1.40 -1.25 -1.39
Z -0.98  0.42 -0.24 -0.21  0.05

In [ ]:
#extracting col A
df['A']

In [20]:
#extracing col A and E
colAE = ['A', 'E']
df[colAE]

      A     E
X -0.11 -0.18
Y -0.71 -1.39
Z -0.98  0.05

In [23]:
#extracting a species element col B, row Z
df['B']['Z']

0.42

In [45]:
#extracting a row
print(df.loc['X'])
print(df.iloc[0])

A     -0.11
B     -0.23
C      0.37
D      0.68
E     -0.18
A+B   -0.34
Name: X, dtype: float64
A     -0.11
B     -0.23
C      0.37
D      0.68
E     -0.18
A+B   -0.34
Name: X, dtype: float64

In [33]:
#adding a column
df['A+B']= df['A']+df['B']
print(df)

      A     B     C     D     E   A+B
X -0.11 -0.23  0.37  0.68 -0.18 -0.34
Y -0.71 -1.37 -1.40 -1.25 -1.39 -2.08
Z -0.98  0.42 -0.24 -0.21  0.05 -0.56

In [42]:
#drop doesnot actually change the df 
print(df.drop('Z', axis=0))
            #axis=0 signifies row deletion, 
print(df.drop('Z'))

print(df.drop('A+B', axis = 1))
                #axis=1 signifies colmn deletion
print(df)

      A     B     C     D     E   A+B
X -0.11 -0.23  0.37  0.68 -0.18 -0.34
Y -0.71 -1.37 -1.40 -1.25 -1.39 -2.08
      A     B     C     D     E   A+B
X -0.11 -0.23  0.37  0.68 -0.18 -0.34
Y -0.71 -1.37 -1.40 -1.25 -1.39 -2.08
      A     B     C     D     E
X -0.11 -0.23  0.37  0.68 -0.18
Y -0.71 -1.37 -1.40 -1.25 -1.39
Z -0.98  0.42 -0.24 -0.21  0.05
      A     B     C     D     E   A+B
X -0.11 -0.23  0.37  0.68 -0.18 -0.34
Y -0.71 -1.37 -1.40 -1.25 -1.39 -2.08
Z -0.98  0.42 -0.24 -0.21  0.05 -0.56

In [46]:
#row and cols of a df
df.shape

(3, 6)

In [50]:
#slicing a dataframe 
print(df)
print(df[['A', 'B']].loc[['X', 'Y']])
print(df[['A', 'B']].loc[['X', 'Y', 'Z']])

      A     B     C     D     E   A+B
X -0.11 -0.23  0.37  0.68 -0.18 -0.34
Y -0.71 -1.37 -1.40 -1.25 -1.39 -2.08
Z -0.98  0.42 -0.24 -0.21  0.05 -0.56
      A     B
X -0.11 -0.23
Y -0.71 -1.37
      A     B
X -0.11 -0.23
Y -0.71 -1.37
Z -0.98  0.42

In [56]:
#Conditional Selection Using Pandas DataFrame
print(df)
print(df[df>0.5])
print(df['C'] < 1)

      A     B     C     D     E   A+B
X -0.11 -0.23  0.37  0.68 -0.18 -0.34
Y -0.71 -1.37 -1.40 -1.25 -1.39 -2.08
Z -0.98  0.42 -0.24 -0.21  0.05 -0.56
    A   B   C     D   E  A+B
X NaN NaN NaN  0.68 NaN  NaN
Y NaN NaN NaN   NaN NaN  NaN
Z NaN NaN NaN   NaN NaN  NaN
X    True
Y    True
Z    True
Name: C, dtype: bool

In [60]:
#setting index

#sets index to col A
print(df.set_index('A'))

#sets index to default
print(df.reset_index())

          B     C     D     E   A+B
A
-0.11 -0.23  0.37  0.68 -0.18 -0.34
-0.71 -1.37 -1.40 -1.25 -1.39 -2.08
-0.98  0.42 -0.24 -0.21  0.05 -0.56
  index     A     B     C     D     E   A+B
0     X -0.11 -0.23  0.37  0.68 -0.18 -0.34
1     Y -0.71 -1.37 -1.40 -1.25 -1.39 -2.08
2     Z -0.98  0.42 -0.24 -0.21  0.05 -0.56

In [64]:
#renaming columns
print(df)

df.columns = [1, 2, 3, 4, 5, 6]
print(df)

      A     B     C     D     E   A+B
X -0.11 -0.23  0.37  0.68 -0.18 -0.34
Y -0.71 -1.37 -1.40 -1.25 -1.39 -2.08
Z -0.98  0.42 -0.24 -0.21  0.05 -0.56
      1     2     3     4     5     6
X -0.11 -0.23  0.37  0.68 -0.18 -0.34
Y -0.71 -1.37 -1.40 -1.25 -1.39 -2.08
Z -0.98  0.42 -0.24 -0.21  0.05 -0.56

In [65]:
print(df)

      1     2     3     4     5     6
X -0.11 -0.23  0.37  0.68 -0.18 -0.34
Y -0.71 -1.37 -1.40 -1.25 -1.39 -2.08
Z -0.98  0.42 -0.24 -0.21  0.05 -0.56

In [ ]:
# missing value treatment for pandas dataframe

In [68]:
rows = ['0','1','2']

cols = ['A', 'B', 'C']

#creating an np array
data = np.array([[1, 5, 1],[2, np.nan, 2],[np.nan, np.nan, 3]])

df=pd.DataFrame(data, rows, cols)
print(df)

     A    B    C
0  1.0  5.0  1.0
1  2.0  NaN  2.0
2  NaN  NaN  3.0

In [70]:
print(df.dropna())
print(df.dropna(axis=1))

     A    B    C
0  1.0  5.0  1.0
     C
0  1.0
1  2.0
2  3.0

In [71]:
df.fillna('🔥')

   A  B    C
0  1  5  1.0
1  2  🔥  2.0
2  🔥  🔥  3.0

In [72]:
# To fill missing values with the average value across the entire DataFrame
df.fillna(df.mean())

     A    B    C
0  1.0  5.0  1.0
1  2.0  5.0  2.0
2  1.5  5.0  3.0

In [86]:
#NEW DATA FRAME FOR GROUPBY
data = [ ['Google', 'Sam', 200],

                    ['Google', 'Charlie', 120],

                    ['Salesforce','Ralph', 125],

                    ['Salesforce','Emily', 250],

                    ['Adobe','Rosalynn', 150],

                    ['Adobe','Chelsea', 500]]
rows = range(0,6)

cols = ['Organization', 'Salesperson Name', 'Sales']

df = pd.DataFrame(data,rows, cols)

df

  Organization Salesperson Name  Sales
0       Google              Sam    200
1       Google          Charlie    120
2   Salesforce            Ralph    125
3   Salesforce            Emily    250
4        Adobe         Rosalynn    150
5        Adobe          Chelsea    500

In [87]:
df.groupby('Organization')

In [89]:
print(df.groupby('Organization').mean())

#The mean (or average) of the sales column

df.groupby('Organization').sum()

#The sum of the sales column

df.groupby('Organization').std()

#The standard deviation of the sales column

# since all of the operations above are numerical, they will automatically ignore 
# the Salesperson Name column, because it only contains strings.

              Sales
Organization
Adobe         325.0
Google        160.0
Salesforce    187.5

                   Sales
Organization
Adobe         247.487373
Google         56.568542
Salesforce     88.388348

In [92]:
print(df.groupby('Organization').count())

#Counts the number of observations

print(df.groupby('Organization').max())

#Returns the maximum value

print(df.groupby('Organization').min())

#Returns the minimum value

              Salesperson Name  Sales
Organization
Adobe                        2      2
Google                       2      2
Salesforce                   2      2
             Salesperson Name  Sales
Organization
Adobe                Rosalynn    500
Google                    Sam    200
Salesforce              Ralph    250
             Salesperson Name  Sales
Organization
Adobe                 Chelsea    150
Google                Charlie    120
Salesforce              Emily    125

In [93]:
df.groupby('Organization').describe()

             Sales
             count   mean         std    min     25%    50%     75%    max
Organization
Adobe          2.0  325.0  247.487373  150.0  237.50  325.0  412.50  500.0
Google         2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Salesforce     2.0  187.5   88.388348  125.0  156.25  187.5  218.75  250.0

In [ ]:
# The Pandas concat Method

In [98]:
#data frames to be used

df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],

                        'B': ['B0', 'B1', 'B2', 'B3'],

                        'C': ['C0', 'C1', 'C2', 'C3'],

                        'D': ['D0', 'D1', 'D2', 'D3']},

                        index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],

                        'B': ['B4', 'B5', 'B6', 'B7'],

                        'C': ['C4', 'C5', 'C6', 'C7'],

                        'D': ['D4', 'D5', 'D6', 'D7']},

                         index=[4, 5, 6, 7]) 

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],

                        'B': ['B8', 'B9', 'B10', 'B11'],

                      'C': ['C8', 'C9', 'C10', 'C11'],

                        'D': ['D8', 'D9', 'D10', 'D11']},

                        index=[8, 9, 10, 11])
print(df1)
print(df2)
print(df3)

row_concat = pd.concat([df1, df2, df3])
print(row_concat)

col_concat = pd.concat([df1, df2, df3] , axis=1)
print(col_concat)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7
      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11
      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [ ]:
#  Merge Pandas DataFrames

In [99]:
leftDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                     'A': ['A0', 'A1', 'A2', 'A3'],

                     'B': ['B0', 'B1', 'B2', 'B3']})

   

rightDataFrame = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],

                          'C': ['C0', 'C1', 'C2', 'C3'],

                          'D': ['D0', 'D1', 'D2', 'D3']}) 

merged_df = pd.merge(leftDataFrame, rightDataFrame, how='inner', on='key') #key is common col
                                            #  This is the type of merge

print(leftDataFrame)
print(rightDataFrame)
print(merged_df)

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3
  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3
  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [ ]:
# Join in Pandas Dataframe

In [100]:
leftDataFrame = pd.DataFrame({  'A': ['A0', 'A1', 'A2', 'A3'],

                                'B': ['B0', 'B1', 'B2', 'B3']},

                                index =['K0', 'K1', 'K2', 'K3'])

   

rightDataFrame = pd.DataFrame({ 'C': ['C0', 'C1', 'C2', 'C3'],

                                'D': ['D0', 'D1', 'D2', 'D3']},

                                index = ['K0', 'K1', 'K2', 'K3']) 

joined_df = leftDataFrame.join(rightDataFrame)

print(leftDataFrame)
print(rightDataFrame)
print(joined_df)

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3
     C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2
K3  C3  D3
     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In [ ]:
# Other COMMON OPERATIONS in Pandas

In [109]:
df = pd.DataFrame({'col1':['A','B','C','D'],

                   'col2':[2,7,3,7],

                   'col3':['fgh','rty','asd','qwe']})


print(df)
print("")
print(df['col2'].unique())
print("")
print(df['col2'].nunique())
print("")
print(df['col2'].value_counts())
print("")
print(df['col3'].apply(len))
print("")
print(df.sort_values('col2'))
print("")
print("")

def exponentify(x):

    return x**x

print(df['col2'].apply(exponentify))

  col1  col2 col3
0    A     2  fgh
1    B     7  rty
2    C     3  asd
3    D     7  qwe

[2 7 3]

3

7    2
2    1
3    1
Name: col2, dtype: int64

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

  col1  col2 col3
0    A     2  fgh
2    C     3  asd
1    B     7  rty
3    D     7  qwe


0         4
1    823543
2        27
3    823543
Name: col2, dtype: int64

In [ ]:
pd.read_csv()

pd.read_json()

pd.read_html()

pd.read_excel()

In [3]:
import pandas as pd
df = pd.DataFrame(
{"a" : [4 ,5, 6],
"b" : [7, 8, 9],
"c" : [10, 11, 12]},
index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [4]:
df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [6]:
df = pd.DataFrame(
{"a" : [4 ,5, 6],
"b" : [7, 8, 9],
"c" : [10, 11, 12]},
index = pd.MultiIndex.from_tuples(
[('d',1),('d',2),('e',2)],
names=['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12